tutorials/icoFoamAutoMotion/newMovingCone/constant/motionProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          motionProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoDMotion      yes;

motionPlaneNormal (0 0 1);

frozenDiffusion     true;

diffusion           file;
// diffusion           constant;
// diffusion           linear;
// diffusion           quadratic;
// diffusion           exponential;
// diffusion           skewness;
// diffusion           nonOrthogonality;
// diffusion           mixedQuality;

distancePatches     0 ();

// ************************************************************************* //
